In [1]:
import pandas as pd
import numpy as np

In [10]:
# nyse = pd.read_csv('')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3370 entries, 0 to 3369
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Symbol        3370 non-null   object
 1   Company Name  3370 non-null   object
dtypes: object(2)
memory usage: 52.8+ KB

In [14]:
df.rename(columns={'Ticker': 'Symbol'}, inplace=True)

In [13]:
df1.rename(columns={'Company Name': 'Name'}, inplace=True)

In [21]:
import pandas as pd
url = "https://pkgstore.datahub.io/core/nyse-other-listings/nyse-listed_csv/data/3c88fab8ec158c3cd55145243fe5fcdf/nyse-listed_csv.csv"
df2 = pd.read_csv(url)

In [22]:
df2

     ACT Symbol                                       Company Name
0             A            Agilent Technologies, Inc. Common Stock
1            AA                            Alcoa Inc. Common Stock
2          AA$B  Alcoa Inc. Depository Shares Representing 1/10...
3           AAC                    AAC Holdings, Inc. Common Stock
4           AAN                         Aaron's, Inc. Common Stock
...         ...                                                ...
3293       ZPIN  Zhaopin Limited American Depositary Shares, ea...
3294        ZQK                      Quiksilver, Inc. Common Stock
3295        ZTR   Zweig Total Return Fund, Inc. (The) Common Stock
3296        ZTS                   Zoetis Inc. Class A Common Stock
3297         ZX  China Zenix Auto International Limited America...

[3298 rows x 2 columns]

In [25]:
df2.rename(columns={'ACT Symbol': 'Symbol', 'Company Name': 'Name'}, inplace=True)

In [28]:
df2['Name'] = df2['Name'].apply(lambda x: func(x))

In [61]:
def func(x):
    if 'Limited' in x:
        return x[:x.find('Limited')]
    return x

In [29]:
df2

     Symbol                                               Name
0         A                        Agilent Technologies, Inc.
1        AA                                        Alcoa Inc.
2      AA$B  Alcoa Inc. Depository Shares Representing 1/10...
3       AAC                                AAC Holdings, Inc.
4       AAN                                     Aaron's, Inc.
...     ...                                                ...
3293   ZPIN  Zhaopin Limited American Depositary Shares, ea...
3294    ZQK                                  Quiksilver, Inc.
3295    ZTR               Zweig Total Return Fund, Inc. (The)
3296    ZTS                               Zoetis Inc. Class A
3297     ZX  China Zenix Auto International Limited America...

[3298 rows x 2 columns]

In [31]:
df2.to_csv('NYSE.csv', index=False)

In [32]:
nas = pd.read_csv('nasdaq-listed-symbols.csv')

In [34]:
nas.rename(columns={'Company Name': 'Name'})

     Symbol                            Name
0      AABA                    Altaba Inc.
1       AAL  American Airlines Group, Inc.
2      AAME  Atlantic American Corporation
3      AAOI  Applied Optoelectronics, Inc.
4      AAON                     AAON, Inc.
...     ...                             ...
3365  ZNWAA             Zion Oil & Gas Inc
3366     ZS                  Zscaler, Inc.
3367   ZSAN      Zosano Pharma Corporation
3368   ZUMZ                    Zumiez Inc.
3369   ZYNE  Zynerba Pharmaceuticals, Inc.

[3370 rows x 2 columns]

In [36]:
nas.to_csv('NASDAQ.csv', index=False)

In [37]:
snp = pd.read_csv('snp.csv')

In [41]:
snp.drop(['Sector'], axis=1, inplace=True)

In [43]:
snp.to_csv('S&P500.csv', index=False)

In [62]:
nse = pd.read_csv('nse.csv')

In [63]:
nse.drop('Unnamed: 0', axis=1, inplace=True)

In [64]:
nse['Name'] = nse['Name'].apply(lambda x: x.split('_')).apply(lambda x: ' '.join(x)).apply(lambda x: func(x))

In [68]:
nse.to_csv('NSE.csv', index=False)

In [69]:
nas = pd.read_csv('Stocks list/NASDAQ.csv')

In [72]:
nas.rename(columns={'Company Name': 'Name'}, inplace=True)

In [73]:
nas.to_csv('NASDAQ.csv', index=False)

In [74]:
import yfinance as yf

In [77]:
start = '2013-10-18'
end = '2023-10-18'
data = yf.download('AAPL', start, end)
data = data.reset_index()
data

[*********************100%%**********************]  1 of 1 completed

,Date,Open,High,Low,Close,Adj Close,Volume
0,2013-10-18,18.071072,18.187857,18.061071,18.174643,15.861938,290542000
1,2013-10-21,18.277500,18.725000,18.268572,18.620001,16.250626,398106800
2,2013-10-22,18.800358,18.873215,18.143929,18.566786,16.204182,534063600
3,2013-10-23,18.535713,18.773930,18.535713,18.748571,16.362837,313723200
4,2013-10-24,18.750000,19.016787,18.658930,18.996786,16.579464,384764800
...,...,...,...,...,...,...,...
2509,2023-10-09,176.809998,179.050003,175.800003,178.990005,178.990005,42390800
2510,2023-10-10,178.100006,179.720001,177.949997,178.389999,178.389999,43698000
2511,2023-10-11,178.199997,179.850006,177.600006,179.800003,179.800003,47551100
2512,2023-10-12,180.070007,182.339996,179.039993,180.710007,180.710007,56743100
2513,2023-10-13,181.419998,181.929993,178.139999,178.850006,178.850006,51427100